let points_data = {
        // 钱塘
           	'330114000000':
			{vArray:[
                {x:3304,y:1703,text:"0",areaNo:'A_X_0'},
                {x:3416,y:1922,text:"1",areaNo:'ff8080817d802da3017d8412d71b0005'}, //待检区
                {x:3052,y:1924,text:"2",areaNo:'A_X_2'},//
                {x:3099,y:2102,text:"3",areaNo:'ff8080817d802da3017d84480e36000c'},//隐私检查区1
                {x:2784,y:1924,text:"4",areaNo:'ff8080817d802da3017d84473b8b000a'},// 信息登记检查区
                {x:2832,y:2102,text:"5",areaNo:'ff8080817d802da3017d84488ceb000f'},//隐私检查区2
                {x:2252,y:1929,text:"6",areaNo:'A_X_6'},
                {x:2260,y:2103,text:"7",areaNo:'A_X_7'},//
                {x:2561,y:2100,text:"8",areaNo:'ff8080817d802da3017d844943820011'},//尿检区
                {x:2018,y:1935,text:"9",areaNo:'A_X_9'},//
                {x:2015,y:2103,text:"10",areaNo:'ff8080817d802da3017d844b819a0015'},//醒酒区
                {x:1650,y:2108,text:"11",areaNo:'ff8080817d802da3017d844c05ea0017'},//等候室1
                {x:1663,y:1948,text:"12",areaNo:'ff8080817d802da3017d844c3b220019'},//等候室2
                {x:2017,y:1818,text:"13",areaNo:'ff8080817d802da3017d844b10db0013'},//看守区1
                {x:2020,y:1706,text:"14",areaNo:'A_X_14'},
                {x:1674,y:1703,text:"15",areaNo:'ff8080817d802da3017d844c731a001b'},//等候室3
                {x:2017,y:1593,text:"16",areaNo:'A_X_16'},
                {x:1698,y:1591,text:"17",areaNo:'ff8080817d802da3017d844c9005001d'},//等候室4
                {x:2017,y:1492,text:"18",areaNo:'ff8080817d8da311017d8de397be001e'},//看守区2
                {x:2073,y:1327,text:"19",areaNo:'ff8080817d802da3017d844d5e1d0029'},//等候室10
                {x:1980,y:1330,text:"20",areaNo:'ff8080817d802da3017d844d17f40027'},//等候室9
                {x:1892,y:1492,text:"21",areaNo:'A_X_21'},
                {x:1897,y:1327,text:"22",areaNo:'ff8080817d802da3017d844cf55a0025'},//等候室8
                {x:1809,y:1487,text:"23",areaNo:'A_X_23'},//
                {x:1817,y:1326,text:"24",areaNo:'ff8080817d802da3017d844cdb3c0023'},//等候室7
                {x:1724,y:1489,text:"25",areaNo:'A_X_'},//
                {x:1730,y:1334,text:"26",areaNo:'ff8080817d802da3017d844cc0270021'},//等候室6
                {x:1631,y:1489,text:"27",areaNo:'A_X_27'},//
                {x:1649,y:1334,text:"28",areaNo:'ff8080817d802da3017d844ca816001f'},//等候室5
                {x:1439,y:1490,text:"29",areaNo:'ff8080817d8da311017d8da928030003'},//审讯区A走廊
                {x:1469,y:1374,text:"30",areaNo:'ff8080817d8da311017d8e500cf50026'},//讯/询问室1
                {x:1247,y:1489,text:"31",areaNo:'A_X_31'},
                {x:1292,y:1362,text:"32",areaNo:'ff8080817d8da311017d8e502eb90028'},//讯/询问室2
                {x:1064,y:1489,text:"33",areaNo:'A_X_33'},
                {x:1122,y:1367,text:"34",areaNo:'ff8080817d8da311017d8e513834002c'},//讯/询问室3
                {x:872,y:1487 ,text:"35",areaNo:'A_X_35'},
                {x:925,y:1374 ,text:"36",areaNo:'ff8080817d8da311017d8e51504a002e'},//讯/询问室4
                {x:754,y:1490 ,text:"37",areaNo:'A_X_'},//
                {x:805,y:1369 ,text:"38",areaNo:'ff8080817d8da311017d8e51ee810034'},//未成年讯/询问室
                {x:1442,y:1825,text:"39",areaNo:'ff8080817d8da311017d8da962aa0005'},//审讯区B走廊
                {x:1420,y:2062,text:"40",areaNo:'ff8080817d8da311017d8e5465e3003e'},  //卫生间
                {x:1386,y:1823,text:"41",areaNo:'A_X_41'},//
                {x:1428,y:1630,text:"42",areaNo:'ff8080817d8da311017d8e5173820030'},//讯/询问室5
                {x:1165,y:1826,text:"43",areaNo:'A_X_43'},//
                {x:1223,y:1623,text:"44",areaNo:'ff8080817d8da311017d8e5197990032'},//讯/询问室6
                {x:1090,y:2087,text:"45",areaNo:'A_X_45'},//
                {x:940,y:1830 ,text:"46",areaNo:'A_X_46'}, //
                {x:1018,y:1634,text:"47",areaNo:'ff8080817d8da311017d8e522cce0036'}, //讯/询问室7
                {x:853,y:1831 ,text:"48",areaNo:'A_X_48'},//
                {x:813,y:1951 ,text:"49",areaNo:'A_X_49'},
                {x:772,y:2116 ,text:"50",areaNo:'ff8080817d8da311017d8e4f8f130024'},//毒品称重室
                {x:716,y:1831 ,text:"51",areaNo:'A_X_51'}, 
                {x:610,y:2058 ,text:"52",areaNo:'ff8080817d8da311017d8e5260c4003a'},//讯/询问室9
                {x:688,y:1831 ,text:"53",areaNo:'A_X_53'}, 
                {x:786,y:1638 ,text:"54",areaNo:'ff8080817d8da311017d8e5247b40038'},//讯/询问室8
                {x:463,y:1834 ,text:"55",areaNo:'A_X_55'}, 
                {x:328,y:2081 ,text:"56",areaNo:'ff8080817d8da311017d8e528823003c'},//讯/询问室10
                {x:402,y:1833 ,text:"57",areaNo:'A_X_57'},//
                {x:485,y:1708 ,text:"58",areaNo:'A_X_58'},
                {x:532,y:1626 ,text:"59",areaNo:'ff8080817d8da311017d8e50ad69002a'},//特殊讯/询问室
                {x:2175,y:1489,text:"60",areaNo:'A_X_60'},//
                {x:2175,y:1431,text:"61",areaNo:'ff8080817d8da311017d8eaf490d0043'},//民警通道
                {x:2178,y:1593,text:"62",areaNo:'A_X_62'},
                {x:2253,y:1593,text:"63",areaNo:'A_X_63'}, 
                {x:2655,y:1594,text:"64",areaNo:'ff8080817d8da311017d8eaed9fd0041'},//取物区通道
                {x:2999,y:1598,text:"65",areaNo:'ff8080817d8da311017d8eaf72de0045'},//办案区出口
                {x:1688,y:1818,text:"66",areaNo:'ff8080817d8da311017d8e42bef80022'}//审讯区B走廊入口

			],eArray:[
				[0,1,1],				[1,2,1],				[2,3,1],				[2,4,1],				[4,5,1],				[4,6,1],               
				[6,7,1],				[7,8,1],				[6,9,1],				[9,10,1],			 	[10,11,1],				[9,12,1],//
				[9,13,1],				[13,14,1],				[14,15,1],				[14,16,1],				[16,17,1],				[16,18,1],
				[18,19,1],				[18,20,1],				[18,21,1],				[21,22,1],				[21,23,1],				[23,24,1],
				[23,25,1],				[25,26,1],				[25,27,1],				[27,28,1],				[27,29,1],				[29,30,1],
				[29,31,1],				[31,32,1],				[31,33,1],				[33,34,1],				[33,35,1],				[35,36,1], 
				[35,37,1],				[37,38,1],				[66,39,1],				[39,40,1],				[39,41,1],				[41,42,1],
				[41,43,1],				[43,44,1],				[43,45,1],				[43,46,1],				[46,47,1],				[46,48,1],
                [48,49,1],              [49,50,1],              [48,51,1],              [51,52,1],              [51,53,1],              [53,54,1],
                [53,55,1],              [55,56,1],              [55,57,1],              [57,58,1],              [58,59,1],              [18,60,1],
                [60,61,1],              [60,62,1],              [62,63,1],              [63,64,1],              [64,65,1],              [16,62,1],
                [18,62,1],              [16,60,1],              [14,62,1],              [14,63,1],              [13,66,1],              [7,9,1],
                [7,10,1]

			], rooms:{
                /*
                */
				"b56a80e67d55ed2d017d55f54a4c0007":{addr:{},width:30,x:330,y:168},
			}},

                //宁国
        	'341881000000':
			{vArray:[
                {x:531,y:247,text:"0",areaNo:'b56a80e67d55ed2d017d55f1f5040001'},//信息登记大厅
                {x:576,y:246,text:"1",areaNo:'b56a80e67d5f2c34017d6563db77000e'}, //核酸采样室
                {x:450,y:247,text:"2",areaNo:'b56a80e67d55ed2d017d55f2c5f70003'},//人身检查、信息采集区
                {x:409,y:248,text:"3",areaNo:'A_X_3'},
                {x:409,y:243,text:"4",areaNo:'A_X_4'},
                {x:382,y:244,text:"5",areaNo:'b56a80e67d55ed2d017d560445e30036'},//手机采集室
                {x:409,y:222,text:"6",areaNo:'A_X_6'},
                {x:383,y:223,text:"7",areaNo:'b56a80e67d55ed2d017d560319300034'},//毒品称重室
                {x:409,y:196,text:"8",areaNo:'b56a80e67d55ed2d017d55f3eee80005'},//看守区
                {x:409,y:169,text:"9",areaNo:'b56a80e67d55ed2d017d55fa174e000d'},//候问室4
                {x:433,y:197,text:"10",areaNo:'A_X_10'},
                {x:433,y:169,text:"11",areaNo:'b56a80e67d55ed2d017d55fa554a000f'},//候问室5
                {x:448,y:196,text:"12",areaNo:'A_X_12'},
                {x:449,y:169,text:"13",areaNo:'b56a80e67d55ed2d017d55fab3af0011'},//候问室6
                {x:462,y:196,text:"14",areaNo:'A_X_14'},
                {x:462,y:211,text:"15",areaNo:'b56a80e67d55ed2d017d56066f560038'},//取物区
                {x:485,y:197,text:"16",areaNo:'A_X_16'},
                {x:480,y:185,text:"17",areaNo:'b56a80e67d55ed2d017d5606e5d0003a'},//尿检区
                {x:476,y:169,text:"18",areaNo:'b56a80e67d55ed2d017d56077f3c003c'},//看守区卫生间
                {x:536,y:196,text:"19",areaNo:'A_X_19'},
                {x:534,y:187,text:"20",areaNo:'b56a80e67d55ed2d017d560a48c00041'},//体检区
                {x:556,y:195,text:"21",areaNo:'A_X_21'},
                {x:584,y:195,text:"22",areaNo:'b56a80e67d55ed2d017d560b05750043'},//检查室
                {x:561,y:210,text:"23",areaNo:'b56a80e67d55ed2d017d560bc3aa0045'},//出区通道
                {x:386,y:197,text:"24",areaNo:'A_X_24'},
                {x:385,y:169,text:"25",areaNo:'b56a80e67d55ed2d017d55f60c05000b'},//候问室3
                {x:374,y:197,text:"26",areaNo:'A_X_26'},
                {x:373,y:169,text:"27",areaNo:'b56a80e67d55ed2d017d55f5b4df0009'},//候问室2
                {x:361,y:197,text:"28",areaNo:'A_X_28'},
                {x:360,y:169,text:"29",areaNo:'b56a80e67d55ed2d017d55f54a4c0007'},//候问室1
                {x:303,y:198,text:"30",areaNo:'b56a80e67d5f2c34017d654db2c70008'},//讯问室走廊1
                {x:303,y:210,text:"31",areaNo:'A_X_31'},
                {x:271,y:211,text:"32",areaNo:'b56a80e67d55ed2d017d5608855a003f'},//嫌疑人卫生间
                {x:301,y:223,text:"33",areaNo:'A_X_33'},
                {x:334,y:223,text:"34",areaNo:'b56a80e67d55ed2d017d55ff6b7a0028'},//讯/询问室11
                {x:298,y:248,text:"35",areaNo:'A_X_35'},
                {x:334,y:249,text:"36",areaNo:'b56a80e67d55ed2d017d55ff9e06002a'},//讯/询问室12
                {x:267,y:249,text:"37",areaNo:'b56a80e67d55ed2d017d55fb49390013'},//讯/询问室1
                {x:294,y:280,text:"38",areaNo:'A_X_38'},
                {x:264,y:278,text:"39",areaNo:'b56a80e67d55ed2d017d55fcb9e00016'},//讯/询问室2
                {x:292,y:306,text:"40",areaNo:'b56a80e67d5f2c34017d654e8a4d000a'},  //讯问室走廊2
                {x:261,y:306,text:"41",areaNo:'b56a80e67d55ed2d017d55fd21180018'},//讯/询问室3
                {x:288,y:337,text:"42",areaNo:'A_X_42'},
                {x:256,y:336,text:"43",areaNo:'b56a80e67d55ed2d017d55fd6b95001a'},//讯/询问室4
                {x:283,y:371,text:"44",areaNo:'A_X_44'},
                {x:247,y:372,text:"45",areaNo:'b56a80e67d55ed2d017d55fe0adc001c'},//讯/询问室5
                {x:278,y:408,text:"46",areaNo:'A_X_46'}, //
                {x:242,y:408,text:"47",areaNo:'b56a80e67d55ed2d017d55fe55c4001e'}, //讯/询问室6
                {x:324,y:408,text:"48",areaNo:'b56a80e67d55ed2d017d5601d1340030'},//未成年讯/询问室13
                {x:274,y:440,text:"49",areaNo:'A_X_49'},
                {x:273,y:448,text:"50",areaNo:'A_X_50'},
                {x:231,y:448,text:"51",areaNo:'b56a80e67d55ed2d017d55fe93ee0020'}, //讯/询问室7
                {x:268,y:493,text:"52",areaNo:'b56a80e67d5f2c34017d65501fd7000c'},//讯问室走廊3
                {x:224,y:493,text:"53",areaNo:'b56a80e67d55ed2d017d55fecfa80022'}, //讯/询问室8
                {x:261,y:542,text:"54",areaNo:'A_X_54'},
                {x:214,y:543,text:"55",areaNo:'b56a80e67d55ed2d017d55ff04720024'}, //讯/询问室9
                {x:254,y:600,text:"56",areaNo:'A_X_56'},
                {x:191,y:600,text:"57",areaNo:'b56a80e67d55ed2d017d560269a90032'},//特殊讯/询问室10
                {x:249,y:641,text:"58",areaNo:'A_X_58'},
                {x:289,y:543,text:"59",areaNo:'b56a80e67d5f2c34017d658848720012'},//讯问室走廊4
                {x:293,y:490,text:"60",areaNo:'b56a80e67d55ed2d017d5600d1df002e'},//未成年讯/询问室14
                {x:307,y:543,text:"61",areaNo:'A_X_61'},
                {x:306,y:605,text:"62",areaNo:'A_X_62'},
                {x:289,y:615,text:"63",areaNo:'b56a80e67d55ed2d017d55ff3e920026'}, //讯/询问室15
                {x:331,y:542,text:"64",areaNo:'A_X_64'},
                {x:330,y:606,text:"65",areaNo:'A_X_65'},
                {x:345,y:615,text:"66",areaNo:'b56a80e67d55ed2d017d55ffcab0002c'}, //讯/询问室16
                {x:356,y:542,text:"67",areaNo:'A_X_67'},
                {x:316,y:440,text:"68",areaNo:'b56a80e67d69e1f5017d6eb15650004b'},//辨认室
                {x:359,y:440,text:"69",areaNo:'A_X_69'},
                {x:358,y:498,text:"70",areaNo:'b56a80e67d69e1f5017d6eb0b5c20049'}  //远程提审室

			],eArray:[
				[0,2,1],				[0,23,1],				[2,3,1],				[3,4,1],				[4,5,1],				[4,6,1],               
				[6,7,1],				[6,8,1],				[8,9,1],				[8,10,1],			 	[10,11,1],				[10,12,1],//
				[12,13,1],				[12,14,1],				[14,15,1],				[14,16,1],				[16,17,1],				[17,18,1],
				[16,19,1],				[19,20,1],				[19,21,1],				[21,22,1],				[21,23,1],				[8,24,1],
				[24,25,1],				[24,26,1],				[26,27,1],				[26,28,1],				[28,29,1],				[28,30,1],
				[30,31,1],				[31,32,1],				[31,33,1],				[33,34,1],				[33,35,1],				[35,36,1], 
				[35,37,1],				[35,38,1],				[38,39,1],				[38,40,1],				[40,41,1],				[40,42,1],
				[42,43,1],				[42,44,1],				[44,45,1],				[44,46,1],				[46,47,1],				[46,48,1],
                [46,49,1],              [49,50,1],              [50,51,1],              [50,52,1],              [52,53,1],              [52,54,1],
                [54,55,1],              [54,56,1],              [56,57,1],              [56,58,1],              [54,59,1],              [59,60,1],
                [59,61,1],              [61,62,1],              [62,63,1],              [61,64,1],              [64,65,1],
                [65,66,1],              [64,67,1],              [49,68,1],              [68,69,1],              [69,70,1],              [23,1,1]

			], rooms:{
                /*
                {x:334,y:223,text:"34",areaNo:'b56a80e67d55ed2d017d55ff6b7a0028'},//讯/询问室11
                {x:534,y:187,text:"20",areaNo:'b56a80e67d55ed2d017d560a48c00041'},//体检区
                */
				"b56a80e67d55ed2d017d55ff6b7a0028":{x:312,y:202,width:30,height:22},
				"b56a80e67d55ed2d017d560a48c00041":{x:515,y:168,width:55,height:30},
			}},

            /* 温州龙岗*/
            /*
            'a956fec37bf2daa4017bf2ed46da0002', '办案区入口 1', '0E237409E0F74473B
            'a956fec37bf32012017bf7afdf890068', '大厅通向办案区门口', '0E237409E0F
            */

    		'330327620000':
			{vArray:[
				{x:228,y:392,text:"0",areaNo:'a956fec37bf32012017bf758de790003'}, //待检区
				{x:235,y:450,text:"1",areaNo:'A_X_1'}, 
				{x:237,y:490,text:"2",areaNo:'a956fec37bf32012017bf75b61140006'}, //信息采集室
				{x:242,y:530,text:"3",areaNo:'A_X_3'}, 
				{x:197,y:550,text:"4",areaNo:'a956fec37bf32012017bf75e9b9a0008'}, //隐私检查室1
				{x:193,y:505,text:"5",areaNo:'a956fec37bf32012017bf75ecfd9000a'}, //隐私检查室2
				{x:190,y:465,text:"6",areaNo:'a956fec37bf32012017bf75fa6e4000e'}, //隐私检查室3
				{x:280,y:438,text:"7",areaNo:'A_X_7'}, 
				{x:273,y:396,text:"8",areaNo:'a956fec37bf32012017bf7709a430011'}, //尿检区
				{x:303,y:385,text:"9",areaNo:'a956fec37bf32012017bf7710c240013'}, //尿检区厕所
				{x:345,y:418,text:"10",areaNo:'A_X_10'}, 

				{x:346,y:379,text:"11",areaNo:'A_X_11'}, 
				{x:346,y:351,text:"12",areaNo:'A_X_12'}, 
				{x:307,y:350,text:"13",areaNo:'A_X_13'}, 
				{x:345,y:340,text:"14",areaNo:'A_X_14'}, 
				{x:378,y:339,text:"15",areaNo:'A_X_15'}, 
				{x:345,y:300,text:"16",areaNo:'A_X_16'}, 
				{x:286,y:300,text:"17",areaNo:'A_X_17'}, 
				{x:346,y:293,text:"18",areaNo:'A_X_18'}, 
				{x:397,y:293,text:"19",areaNo:'a956fec37bf32012017bf7b291530078'}, //审讯室1
				{x:346,y:276,text:"20",areaNo:'A_X_20'}, 
				{x:287,y:276,text:"21",areaNo:'a956fec37bf32012017bf7b638c90092'}, //辨认室
				{x:346,y:250,text:"22",areaNo:'a956fec37bf32012017bf7b10e430070'}, //审讯室门口走廊
				{x:395,y:247,text:"23",areaNo:'a956fec37bf32012017bf7b2d01f007c'}, //审讯室2
				{x:346,y:245,text:"24",areaNo:'A_X_24'}, 
				{x:289,y:246,text:"25",areaNo:'A_X_25'}, 
				{x:346,y:219,text:"26",areaNo:'A_X_26'}, 
				{x:261,y:221,text:"27",areaNo:'a956fec37bf32012017bf7b8598a00a0'}, //律师会见室走廊
				{x:259,y:230,text:"28",areaNo:'A_X_28'}, 
				{x:237,y:228,text:"29",areaNo:'a956fec37bf32012017bf7b9635a00aa'}, //律师会见室2
				{x:257,y:249,text:"30",areaNo:'A_X_30'}, 
				{x:234,y:249,text:"31",areaNo:'a956fec37bf32012017bf7ba687a00b0'}, //律师会见室门口
				{x:252,y:282,text:"32",areaNo:'A_X_32'}, 
				{x:237,y:282,text:"33",areaNo:'a956fec37bf32012017bf7b9115b00a6'}, //律师会见室1

				{x:346,y:206,text:"34",areaNo:'A_X_34'}, 
				{x:393,y:206,text:"35",areaNo:'a956fec37bf32012017bf7b31537007e'}, //审讯室3
				{x:346,y:195,text:"36",areaNo:'A_X_36'}, 
				{x:297,y:195,text:"37",areaNo:'a956fec37bf32012017bf7b38d5c0084'}, //审讯室5
				{x:346,y:173,text:"38",areaNo:'A_X_38'}, 
				{x:391,y:172,text:"39",areaNo:'a956fec37bf32012017bf7b34b750080'}, //审讯室4
                                     
				{x:346,y:165,text:"40",areaNo:'A_X_40'}, 
				{x:297,y:167,text:"41",areaNo:'a956fec37bf32012017bf7b3b7540086'}, //审讯室6
				{x:347,y:146,text:"42",areaNo:'A_X_42'}, 
				{x:347,y:137,text:"43",areaNo:'A_X_43'}, 
				{x:298,y:139,text:"44",areaNo:'a956fec37bf32012017bf7b3f7cc008a'}, //审讯室7
				{x:393,y:145,text:"45",areaNo:'a956fec37bf32012017bf7aa8c1a004e'}, //厕所门口走廊
				{x:393,y:140,text:"46",areaNo:'a956fec37bf32012017bf7a9ec6a0048'}, //看守区厕所门口
				{x:371,y:127,text:"47",areaNo:'a956fec37bf32012017bf7a90c580042'}, //看守区女厕所
				{x:413,y:127,text:"48",areaNo:'a956fec37bf32012017bf7a8c438003e'}, //看守区男厕所
				{x:424,y:144,text:"49",areaNo:'A_X_49'}, 
				{x:427,y:171,text:"50",areaNo:'A_X_50'}, 
                                     
				{x:448,y:167,text:"51",areaNo:'A_X_51'}, 
				{x:449,y:133,text:"52",areaNo:'a956fec37bf32012017bf78bb1af001b'}, //等候室1
				{x:467,y:173,text:"53",areaNo:'A_X_53'}, 
				{x:486,y:141,text:"54",areaNo:'a956fec37bf32012017bf794f732001d'}, //等候室2
				{x:484,y:187,text:"55",areaNo:'a956fec37bf32012017bf78015340019'}, //看守区
				{x:506,y:174,text:"56",areaNo:'a956fec37bf32012017bf796909f0023'}, //等候室3
				{x:489,y:204,text:"57",areaNo:'A_X_57'}, 
				{x:514,y:211,text:"58",areaNo:'a956fec37bf32012017bf796c2f70025'}, //等候室4
				{x:484,y:217,text:"59",areaNo:'A_X_59'}, 
				{x:507,y:252,text:"60",areaNo:'a956fec37bf32012017bf797c3a00027'}, //等候室5
				{x:462,y:226,text:"61",areaNo:'A_X_61'}, 
				{x:466,y:265,text:"62",areaNo:'a956fec37bf32012017bf797ed810029'}, //等候室6
				{x:433,y:225,text:"63",areaNo:'a956fec37bf32012017bf77badf70017'}, //到达看守区走廊
				{x:441,y:306,text:"64",areaNo:'A_X_64'}, 
				{x:441,y:318,text:"65",areaNo:'A_X_65'}, 
				{x:408,y:318,text:"66",areaNo:'A_X_66'}, 
				{x:448,y:375,text:"67",areaNo:'A_X_67'}, 
				{x:417,y:375,text:"68",areaNo:'a956fec37bf32012017bf778bebb0015'}, //取物门口走廊
				{x:424,y:436,text:"69",areaNo:'A_X_69'}, 
				{x:501,y:372,text:"70",areaNo:'a956fec37bf32012017bf7c1ff2100c4'}, //血检区
				{x:549,y:370,text:"71",areaNo:'a956fec37bf32012017bf7c44a0a00ce'}, //CT检查区
				{x:508,y:407,text:"72",areaNo:'A_X_72'}, 
				{x:555,y:404,text:"73",areaNo:'a956fec37bf32012017bf7c311cd00c8'}, //B超心电图检查区
				{x:503,y:302,text:"74",areaNo:'a956fec37bf32012017bf7c7b43400e4'}, //通向特殊审讯室走廊
				{x:570,y:299,text:"75",areaNo:'a956fec37bf32012017bf7c88e6800ea'}, //特殊审讯室门口走廊
				{x:607,y:296,text:"76",areaNo:'A_X_76'}, 
				{x:556,y:243,text:"77",areaNo:'a956fec37bf32012017bf7ca68d100f5'}, //特殊审讯室
				{x:545,y:212,text:"78",areaNo:'a956fec37bf32012017bf7cbee4b0100'}, //特殊审讯室厕所
				{x:589,y:239,text:"79",areaNo:'a956fec37bf32012017bf7cea5f3010c'}, //未成年人审讯室
				{x:580,y:209,text:"80",areaNo:'a956fec37bf32012017bf7d030340111'}, //未成年人审讯室旁门口
				{x:446,y:472,text:"81",areaNo:'a956fec37c0aef08017c0c942bd500eb'}, //办案区出口


			],eArray:[
				[0,1,1],				[1,2,1],				[2,3,1],				[3,4,1],				[2,5,1],				[1,6,1],               
				[1,7,1],				[7,8,1],				[8,9,1],				[7,10,1],			 	[10,11,1],				[11,12,1],//
				[12,13,1],				[12,14,1],				[14,15,1],				[14,16,1],				[16,17,1],				[16,18,1],
				[18,19,1],				[18,20,1],				[20,21,1],				[20,22,1],				[22,23,1],				[22,24,1],
				[24,25,1],				[24,26,1],				[26,27,1],				[27,28,1],				[28,29,1],				[28,30,1],
				[30,31,1],				[30,32,1],				[32,33,1],				[26,34,1],				[34,35,1],				[34,36,1], 
				[36,37,1],				[36,38,1],				[38,39,1],				[38,40,1],				[40,41,1],				[40,42,1],
				[42,43,1],				[43,44,1],				[42,45,1],				[45,46,1],				[46,47,1],				[46,48,1],
                [45,49,1],                [49,50,1],                [50,51,1],                [51,52,1],                [51,53,1],                [53,54,1],
                [53,55,1],                [55,56,1],                [55,57,1],                [57,58,1],                [57,59,1],                [59,60,1],
                [59,61,1],                [61,62,1],                [61,63,1],                [50,63,5],                [63,64,1],                [64,65,1],
                [65,66,1],                [65,67,1],                [67,68,1],                [11,68,1],                [68,69,1],                [67,70,1],
                [70,71,1],                [70,72,1],                [72,73,1],                [64,74,1],                [74,75,1],                [75,76,1],
                [75,77,1],                [77,78,1],                [76,79,1],                [79,80,1],                [69,81,1],

			], rooms:{
                /*
'a956fec37bf32012017bf78bb1af001b', '等候室1', '0E237409E0F74473BEFFA6
'a956fec37bf32012017bf794f732001d', '等候室2', '0E237409E0F74473BEFFA6
'a956fec37bf32012017bf796909f0023', '等候室3', '0E237409E0F74473BEFFA6
'a956fec37bf32012017bf796c2f70025', '等候室4', '0E237409E0F74473BEFFA6
'a956fec37bf32012017bf797c3a00027', '等候室5', '0E237409E0F74473BEFFA6
'a956fec37bf32012017bf797ed810029', '等候室6', '0E237409E0F74473BEFFA6
                */
				"a956fec37bf32012017bf78bb1af001b":{addr:{},width:30,x:436,y:118},
				"a956fec37bf32012017bf794f732001d":{addr:{},width:30,x:475,y:118},
				"a956fec37bf32012017bf796909f0023":{addr:{},width:30,x:495,y:153},
				"a956fec37bf32012017bf796c2f70025":{addr:{},width:30,x:505,y:190},
				"a956fec37bf32012017bf797c3a00027":{addr:{},width:40,x:499,y:240},
				"a956fec37bf32012017bf797ed810029":{addr:{},width:25,x:456,y:251},
				//"a948a8827af369d9017af95963d50024":{addr:{},width:40,x:291,y:200},
				//"a948a8827af369d9017af95985d40026":{addr:{},width:40,x:291,y:200}
			}},


		'330109180000':
			/**
                id	name
                a948a8827af369d9017af942cd8c0007	信息采集区
                a948a8827af369d9017af9435fba0009	登记区 
                a948a8827af369d9017af9556e77000b	待检区
                a948a8827af369d9017af955c939000d	看守区
                a948a8827af369d9017af9562999000f	办案区出入口
                a948a8827af369d9017af956cec30011	审讯室走廊1
                a948a8827af369d9017af95717360013	审讯室走廊2
                a948a8827af369d9017af95761bc0015	尿检区
                a948a8827af369d9017af95797240017	尿检区卫生间
                a948a8827af369d9017af958539e0019	等候室1
                a948a8827af369d9017af958ced9001c	等候室2
                a948a8827af369d9017af958f7dd001e	等候室3
                a948a8827af369d9017af9591ab60020	等候室4
                a948a8827af369d9017af959432e0022	等候室5
                a948a8827af369d9017af95963d50024	等候室6
                a948a8827af369d9017af95985d40026	等候室7
                a948a8827af369d9017af95a44910028	讯/询问室1
                a948a8827af369d9017af95a790e002a	讯/询问室2
                a948a8827af369d9017af95a9aee002c	讯/询问室3
                a948a8827af369d9017af95abb09002e	讯/询问室4
                a948a8827af369d9017af95af61e0030	讯/询问室5
                a948a8827af369d9017af95b188a0032	讯/询问室6
                a948a8827af369d9017af95bc3de0034	未成年讯/询问室
                a948a8827af369d9017af95c16340036	特殊讯/询问室
                a948a8827af9bb1e017b09245fd5010e	等候室走廊1
                a948a8827af9bb1e017b09248d5d0110	等候室走廊2
                a948a8827af9bb1e017b0925e2bd0116	民警通道
                a948a8827af9bb1e017b0926a63c0119	嫌疑人卫生间
			 */
			{vArray:[
				{x:2940,y:2280,text:"0",areaNo:'a948a8827af369d9017af9435fba0009'},//  1， 待检区/登记区
				{x:2440,y:2280,text:"1",areaNo:'A_X_2'}, 
				{x:1820,y:2280,text:"2",areaNo:'a948a8827af369d9017af9556e77000b'},//待检区
				{x:2900,y:2010,text:"3",areaNo:'a948a8827af369d9017af942cd8c0007'},//信息采集区
				{x:2740,y:2010,text:"4",areaNo:'A_X_5'},
				{x:2860,y:1720,text:"5",areaNo:'a948a8827af9bb1e017b09245fd5010e'},//等候室走廊1
				{x:3070,y:1720,text:"6",areaNo:'a948a8827af369d9017af958ced9001c'},//等候室2
				{x:2840,y:1560,text:"7",areaNo:'A_X_8'},
				{x:3080,y:1540,text:"8",areaNo:'a948a8827af369d9017af958f7dd001e'},//等候室3
				{x:2830,y:1450,text:"9",areaNo:'a948a8827af369d9017af955c939000d'},//看守区值班室
				{x:3070,y:1420,text:"10",areaNo:'a948a8827af369d9017af9591ab60020'},//等候室4
				{x:2820,y:1350,text:"11",areaNo:'A_X_12'},
				{x:3060,y:1325,text:"12",areaNo:'a948a8827af369d9017af959432e0022'},//等候室5
				{x:2815,y:1310,text:"13",areaNo:'A_X_14'},
				{x:2800,y:1180,text:"14",areaNo:'A_X_15'},
				{x:3010,y:1180,text:"15",areaNo:'a948a8827af369d9017af95963d50024'},//等候室6
				{x:2630,y:1310,text:"16",areaNo:'A_X_17'},
				{x:2620,y:1130,text:"17",areaNo:'a948a8827af369d9017af95985d40026'},//等候室7
				{x:2660,y:1560,text:"18",areaNo:'A_X_19'},
				{x:2670,y:1750,text:"19",areaNo:'a948a8827af369d9017af958539e0019'},//等候室1
				{x:2440,y:1560,text:"20",areaNo:'a948a8827af369d9017af956cec30011'},//审讯室走廊1
				{x:2440,y:1710,text:"21",areaNo:'A_X_22'},
				{x:2050,y:1710,text:"22",areaNo:'a948a8827af369d9017af95a790e002a'},//讯询问室2
				{x:2440,y:1960,text:"23",areaNo:'A_X_24'},
				{x:2030,y:1960,text:"24",areaNo:'a948a8827af369d9017af95a44910028'},//讯询问室1
				{x:2440,y:1500,text:"25",areaNo:'A_X_26'},
				{x:2060,y:1490,text:"26",areaNo:'a948a8827af369d9017af95a9aee002c'},//讯询问室3
				{x:2440,y:1320,text:"27",areaNo:'A_X_28'},
				{x:1860,y:1320,text:"28",areaNo:'a948a8827af369d9017af95abb09002e'},//讯询问室4
				{x:2440,y:1130,text:"29",areaNo:'A_X_30'},
				{x:2130,y:1130,text:"30",areaNo:'a948a8827af369d9017af95761bc0015'},//尿检区
				{x:1810,y:1130,text:"31",areaNo:'a948a8827af369d9017af95797240017'},//尿检区卫生间
				{x:2440,y:980,text:"32",areaNo:'A_X_33'},
				{x:2480,y:980,text:"33",areaNo:'A_X_34'},
				{x:2480,y:770,text:"34",areaNo:'a948a8827af9bb1e017b0926a63c0119'},//嫌疑人卫生间
				{x:2780,y:980,text:"35",areaNo:'a948a8827af369d9017af95717360013'},//审讯室走廊2
				{x:2880,y:980,text:"36",areaNo:'A_X_37'},
				{x:2850,y:780,text:"37",areaNo:'A_X_38'},
				{x:2730,y:780,text:"38",areaNo:'a948a8827af369d9017af95bc3de0034'},//未成年讯询问室
				{x:3020,y:980,text:"39",areaNo:'A_X_40'},
				{x:3000,y:780,text:"40",areaNo:'A_X_41'},
				{x:3160,y:760,text:"41",areaNo:'a948a8827af369d9017af95af61e0030'},//讯询问室5
				{x:3670,y:980,text:"42",areaNo:'A_X_43'},
				{x:3560,y:750,text:"43",areaNo:'A_X_44'},
				{x:3420,y:750,text:"44",areaNo:'a948a8827af369d9017af95b188a0032'},//讯询问室6
				{x:3850,y:980,text:"45",areaNo:'A_X_46'},
				{x:3840,y:750,text:"46",areaNo:'a948a8827af369d9017af95c16340036'},//特殊审讯室
				{x:2790,y:1080,text:"47",areaNo:'a948a8827af9bb1e017b09248d5d0110'},//等候室走廊2
			],eArray:[
				[0,1,1],				[1,2,1],				[0,3,1],				[3,4,1],				[3,5,1],				[5,6,1],                
				[5,7,1],				[7,8,1],				[7,9,1],				[9,10,1],				[9,11,1],				[11,12,1],
				[11,13,1],				[13,14,1],				[14,15,1],				[13,16,1],				[16,17,1],				[7,18,1],
				[18,19,1],				[18,20,1],				[20,21,1],				[21,22,1],				[21,23,1],				[23,24,1],
				[20,25,1],				[25,26,1],				[25,27,1],				[27,28,1],				[27,29,1],				[29,30,1],
				[30,31,1],				[29,32,1],				[32,33,1],				[33,34,1],				[33,35,1],				[35,36,1], 
				[36,37,1],				[37,38,1],				[36,39,1],				[39,40,1],				[40,41,1],				[39,42,1],
				[42,43,1],				[43,44,1],				[42,45,1],				[45,46,1],				[14,47,1],				[47,35,1],

			], rooms:{
                /*
                a948a8827af369d9017af9556e77000b	待检区
                a948a8827af369d9017af958539e0019	等候室1
                a948a8827af369d9017af958ced9001c	等候室2
                a948a8827af369d9017af958f7dd001e	等候室3
                a948a8827af369d9017af9591ab60020	等候室4
                a948a8827af369d9017af959432e0022	等候室5
                a948a8827af369d9017af95963d50024	等候室6
                a948a8827af369d9017af95985d40026	等候室7
                */
				"a948a8827af369d9017af9435fba0009":{addr:{},width:500,x:1720,y:2240},
				"a948a8827af369d9017af958539e0019":{addr:{},width:180,x:2600,y:1680},
				//"a948a8827af369d9017af958ced9001c":{addr:{},width:40,x:291,y:200},
				//"a948a8827af369d9017af958f7dd001e":{addr:{},width:40,x:291,y:200},
				//"a948a8827af369d9017af9591ab60020":{addr:{},width:40,x:291,y:200},
				//"a948a8827af369d9017af959432e0022":{addr:{},width:40,x:291,y:200},
				//"a948a8827af369d9017af95963d50024":{addr:{},width:40,x:291,y:200},
				//"a948a8827af369d9017af95985d40026":{addr:{},width:40,x:291,y:200}
			}},
	'demo':
			{vArray:[
				{x:185,y:83,text:"1",areaNo:'A_X_110'},
				{x:185,y:115,text:"2",areaNo:'A_X_2'},
				{x:185,y:145,text:"3",areaNo:'A_X_3'},
				{x:185,y:185,text:"4",areaNo:'A_X_4'},
				{x:185,y:220,text:"5",areaNo:'A_X_5'},
				{x:185,y:255,text:"6",areaNo:'A_X_6'},
				{x:185,y:281,text:"7",areaNo:'A_X_27'},
				{x:185,y:325,text:"8",areaNo:'A_X_8'},
				{x:185,y:360,text:"9",areaNo:'A_X_9'},
				{x:185,y:395,text:"10",areaNo:'A_X_10'},
				{x:185,y:430,text:"11",areaNo:'A_X_11'},
				{x:273,y:281,text:"12",areaNo:'A_X_12'},
				{x:273,y:251,text:"13",areaNo:'A_X_13'},
				{x:273,y:222,text:"14",areaNo:'A_X_14'},
				{x:324,y:222,text:"15",areaNo:'A_X_15'},
				{x:272,y:82,text:"16",areaNo:'A_X_16'},
				{x:272,y:82,text:"17",areaNo:'A_X_17'},
				{x:272,y:82,text:"18",areaNo:'A_X_18'},
				{x:272,y:82,text:"19",areaNo:'A_X_19'},
				{x:272,y:92,text:"20",areaNo:'A_X_20'}
			],eArray:[
				[0,15,2],
				[0,1,1],
				[1,2,1],
				[2,3,1],
				[3,4,1],
				[4,5,1],
				[5,6,1],
				[6,7,2],
				[6,11,2],
				[7,8,1],
				[8,9,1],
				[9,10,1],
				[11,12,1],
				[12,13,1],
				[13,14,1],
				[13,15,3]
			], rooms:{
				"A_X_14":{addr:{},width:40,x:291,y:200}
			}},
	//滨江
	'330108180000':
		{vArray:[
				{x:2637,y:2181,text:"1",areaNo:'a947c903765fa83201765fef8af40008'},   //接待区大厅

				{x:2550,y:1735,text:"2",areaNo:'a947c903765fa83201765ff9a068000e'},   //信息采集区
				{x:2933,y:1960,text:"2_1",areaNo:'EX_2_1'},   //信息采集区2_1

				{x:3280,y:1275,text:"3",areaNo:'a947c903765fa83201765ffa32280010'},   //看守区

				{x:3480,y:1730,text:"4",areaNo:'a947c903765fa83201765ffb41fc0012'},   //等候室1
				{x:3250,y:1573,text:"4_1",areaNo:'EX_4_1'},   //等候室1 4_1
				{x:3677,y:1583,text:"5",areaNo:'a947c903765fa83201765ffb8bb10014'},  //等候室2
				{x:3440,y:1448,text:"5_1",areaNo:'EX_5-1'},  //等候室2 5_1
				{x:3810,y:1495,text:"6",areaNo:'a947c903765fa8320176601f77ad0017'},  //等候室3
				{x:3575,y:1365,text:"6_1",areaNo:'EX_6-1'},  //等候室3 6_1
				{x:3965,y:1370,text:"7",areaNo:'a947c903765fa83201766020700d001b'},  //尿检区
				{x:3745,y:1245,text:"7_1",areaNo:'EX_7-1'},  //尿检区7_1
				{x:4070,y:1290,text:"7_2",areaNo:'a947c903765fa8320176602194ba001d'},  //嫌疑人卫生间

				{x:3625,y:1048,text:"8",areaNo:'a947c903765fa8320176601fe0100019'},  //等候室4
				{x:3427,y:1190,text:"8_1",areaNo:'EX_8-1'},  //等候室4 8_1

				{x:2750,y:1060,text:"9",areaNo:'a947c903765fa8320176609fcc3300a7'},  //看守区值班室
				{x:3080,y:1150,text:"9_1",areaNo:'EX_9-1'},  //看守区值班室 9_1
				{x:2830,y:1010,text:"9_2",areaNo:'EX_9-2'},  //看守区值班室 9_2

				{x:3120,y:930,text:"10",areaNo:'a947c903765fa83201766041f0ef0026'},  //未成年审讯室
				{x:3902,y:951,text:"12_3",areaNo:'EX_19'},  //特殊审讯室拐角
				{x:3040,y:880,text:"10_2",areaNo:'EX_10-2'},  //未成年审讯室 10_2

				{x:3351,y:989,text:"11",areaNo:'a947c903765fa832017660263a56001f'},  //特殊审讯走廊

				{x:4050,y:1050,text:"12",areaNo:'a947c903766e23d101766e4dd87a002c'},  //特殊审讯室
				{x:3671,y:824,text:"12_1",areaNo:'EX_12-1'},  //特殊审讯室 12_1
				{x:4092,y:1056,text:"12_2",areaNo:'EX_12-2'},  //特殊审讯室 12_2

				{x:3384,y:668,text:"13",areaNo:'a947c903766e23d101766e6f3e72004e'},  //未成年审讯室走廊
				{x:2798,y:370,text:"14",areaNo:'a947c903765fa83201766029754d0021'},  //审讯室走廊

				{x:2655,y:231,text:"15",areaNo:'a947c903765fa8320176605f6372002a'},  //询问室1
				{x:2840,y:346,text:"15_1",areaNo:'EX_15-1'},  //询问室1 15_1
				{x:2650,y:230,text:"15_2",areaNo:'EX_15-2'},  //询问室1 15_2

				{x:2394,y:370,text:"16",areaNo:'a947c903765fa8320176605fee29002d'},  //询问室2
				{x:2590,y:472,text:"16_1",areaNo:'EX_16-1'},  //询问室2 16_1
				{x:2410,y:344,text:"16_2",areaNo:'EX_16-2'},  //询问室2 16_2

				{x:2105,y:527,text:"17",areaNo:'a947c903765fa83201766060399b002f'},  //询问室3
				{x:2276,y:637,text:"17_1",areaNo:'EX_17-1'},  //询问室3 17_1
				{x:2158,y:476,text:"17_2",areaNo:'EX_17-2'},  //询问室3 17_2

				{x:1355,y:860,text:"18",areaNo:'a947c903765fa8320176606068490031'},  //询问室4
				{x:1567,y:994,text:"18_1",areaNo:'EX_18-1'},  //询问室4 18_1
				{x:1508,y:792,text:"18_2",areaNo:'EX_18-2'},  //询问室4 18_2

				{x:1031,y:1029,text:"19",areaNo:'a947c903765fa83201766060a6170033'},  //询问室5
				{x:1200,y:1167,text:"19_1",areaNo:'EX_19-1'},  //询问室5 19_1
				{x:1156,y:968,text:"19_2",areaNo:'EX_19-2'},  //询问室5 19_2

				{x:1750,y:600,text:"20",areaNo:'a947c903765fa832017660630e810035'},  //审讯区卫生间楼梯
				{x:2000,y:768,text:"20_1",areaNo:'EX_20_1'},  //审讯区卫生间楼梯 20_1
				{x:1646,y:540,text:"21",areaNo:'a947c903765fa832017660664ad80037'},  //审讯室卫生间

				{x:2780,y:1870,text:"2_2",areaNo:'EX_2_2'},   //信息采集区EX_2_2   45
				{x:3237,y:1058,text:"8_2",areaNo:'EX_8_2'}   //等候室4 EX_8_2     46
				],
			/**
			 *   15_2(29) 15_1(28)
			 *   15(27)                                          12_3(19)  12_2(24)
			 * 			  14(26)                13(25)           12_1(23)  12(22)
			 *	 16_2(32) 16_1(31)
			 *	 16(30)							10_2(20)  10(18)
			 * 												            8(13)			   7_2(12)
			 *	 17_2(35) 17_1(34)							     11(21)	8_1(14)	7_1(11)    7(10)
			 *	 17(33)						    9_2(17)	 9_1(16)		8_2(46)	6_1(9)	   6(8)
			 *      		        			9(15)	                3(3)	5_1(7)     5(6)
			 *   21(44) 20(42) 20_1(43)                                		    4_1(5)     4(4)
			 *
			 * 	 18_2(38) 18_1(37)				   				        2(1)	2(45)  	2_1(2)
			 * 	 18(36)							     					                1(0)
			 *
			 * 	 19_2(41) 19_1(40)
			 * 	 19(39)
			 */
			eArray:[
				[0,2,1],   //接待大厅
				[45,1,1],[45,2,1],[45,3,2],[45,5,1],   //信息采集区
				[3,5,2],[3,7,2],[3,9,2],[3,11,2],[3,46,1],[3,21,2],[3,16,2],  //看守区
				[4,5,1],[5,7,1],   //等候室1
				[6,7,1],[7,9,1],   //等候室2
				[8,9,1],[9,11,1],   //等候室3
				[10,11,1],[10,12,1],   //尿检区
				[11,14,1],[13,14,1],[14,46,1],[16,46,1],[9,46,1],    //等候室4
				[15,17,1],[16,17,1],[16,21,1],   //值班室
				[25,23,1],[25,20,1],[25,26,1],[18,20,1],   //未成年审讯室+未成年走廊
				[21,23,1],[19,23,1],[19,22,1],/*[19,24,1],[22,24,1],*/  //特殊审讯室
				[26,28,1],[26,31,1],  //走廊
				/*[27,29,1],[28,29,1]*/[27,28,1],  //询问室1
				/*[30,32,1],[31,32,1]*/[30,31,1],  //询问室2
				/*[33,35,1],[34,35,1]*/[31,34,1],[33,34,1],   //询问室3
				[34,43,1],[42,44,1],[42,43,1],[43,44,1],   //询问室卫生间
				[37,43,1]/*,[37,38,1],[36,38,1]*/,[36,37,1],[37,40,1],   //询问室4
				/*[40,41,1],[39,41,1]*/[39,40,1]

			], rooms:{
				"A_X_12":{addr:{},width:40,x:291,y:200}
			}
		},
	//高新派出所
	"330108550000":{
		vArray:[
			/**            一楼     **/
			{x:2320,y:830,text:"0",areaNo:'EX_1'},   //入口
			{x:1658,y:562,text:"1",areaNo:'a947d6a16685c83e016685e8e5af0005'},   //登记采集区

			{x:1393,y:520,text:"2",areaNo:'EX_2'},   //过道口
			//{x:200,y:1260,text:"3",areaNo:'EX_3'},   //1楼过道

			{x:1170,y:610,text:"3",areaNo:'a947d6a16685c83e0166864af4390013'},   //尿检区

			{x:1562,y:668,text:"4",areaNo:'EX_3'},   //等候室1门口
			{x:1370,y:757,text:"5",areaNo:'a947d6a16685c83e016685ea6f6c0009'},   //等候室1

			{x:1646,y:738,text:"6",areaNo:'EX_4'},   //等候室2门口
			{x:1450,y:842,text:"7",areaNo:'a947d6a16685c83e016685ea8868000b'},   //等候室2
			{x:1870,y:770,text:"8",areaNo:'a947d6a16685c83e016685ea21a80007'},   //看管区

			{x:2005,y:750,text:"9",areaNo:'EX_5'},   //等候室4门口
			{x:2130,y:855,text:"10",areaNo:'a947d6a16685c83e016686440b000010'},   //等候室4

			{x:1788,y:845,text:"11",areaNo:'EX_6'},   //等候室3门口
			{x:1920,y:950,text:"12",areaNo:'a947d6a16685c83e01668641a2b6000e'},   //等候室3门口

			{x:2190,y:665,text:"13",areaNo:'EX_6'},   //待检区门口
			{x:2310,y:760,text:"14",areaNo:'a947d6a16685c83e016685e87bc40003'},   //待检区/入口

			/**            二楼     **/
			{x:2200,y:1400,text:"15",areaNo:'a947d6a16685c83e01668651f83f001d'},   //审讯室走廊

			{x:2093,y:1314,text:"16",areaNo:'EX_7'},   //询问室1门口
			{x:2610,y:1160,text:"17",areaNo:'EX_8'},   //询问室1座椅旁
			{x:2515,y:1093,text:"18",areaNo:'a947d6a16685c83e01668653c090001f'},   //询问室1

			{x:2638,y:1730,text:"19",areaNo:'EX_9'},   //询问室2门口
			{x:3174,y:1557,text:"20",areaNo:'EX_10'},   //询问室2座椅旁
			{x:3063,y:1480,text:"21",areaNo:'a947d6a16685c83e01668653f25a0021'},   //询问室2

			{x:2866,y:1900,text:"22",areaNo:'EX_11'},   //询问室3门口
			{x:3306,y:1647,text:"23",areaNo:'EX_12'},   //询问室3座椅旁
			{x:3410,y:1717,text:"24",areaNo:'a947d6a16685c83e01668654197a0023'},   //询问室3

			{x:3194,y:2144,text:"25",areaNo:'EX_13'},   //特殊询问室门口
			{x:3641,y:1876,text:"26",areaNo:'EX_14'},   //特殊询问室座椅旁
			{x:3761,y:1960,text:"27",areaNo:'a947d6a16685c83e01668654e8bc0025'},   //特殊询问室

			{x:3000,y:2004,text:"28",areaNo:'EX_15'},   //远程提审室门口
			{x:2705,y:2167,text:"29",areaNo:'a947d6a16685c83e016686696aa00040'},   //远程提审室
			//一楼二楼冗余
			{x:1300,y:457,text:"30",areaNo:'EX_16'},   //一楼二楼过度1
			{x:1880,y:204,text:"31",areaNo:'EX_17'},   //一楼二楼过度2
			{x:3064,y:960,text:"32",areaNo:'EX_18'}   //一楼二楼过度3
		],
		/**
		 * 31                                                   32
		 *         0                13   14
		 *         1           8    9    10
		 * 30      2       4   6    11   12         18  17        21 20     23 24     26 27
		 *
		 *         3       5   7                        16      15   19     22   28   25
		 *                                                                       29
		 *

		 */
		eArray:[
			[0,1,1],[1,2,1],[2,3,1],[2,4,1],[2,30,1],[4,5,1],[4,6,1],[6,7,1],[6,8,1],[6,11,1],
			[8,9,1],[9,10,1],[9,11,1],[9,13,1],[11,12,1],[13,14,1],
			[15,16,1],[15,19,1],[15,32,1],/*[16,17,1],[17,18,1]*/[16,18,1],[19,21,1],/*[19,20,1],*/[19,22,1],/*[20,21,1],*/
			[22,23,1],[22,28,1],[23,24,1],[28,29,1],[28,25,1],[25,26,1],[26,27,1],[30,31,1],[31,32,1]
		]
	},
	//浦沿
	"330108530000":{
		vArray:[
			{x:2650,y:1557,text:"0",areaNo:'a947d4a06300c4e501630b18a63b0009'},   //信息登记区
			{x:2440,y:1640,text:"1",areaNo:'EX_1'},   //登记区拐角

			{x:2565,y:1759,text:"2",areaNo:'EX_2'},   //待检区门口
			{x:2120,y:1950,text:"3",areaNo:'a947d4a06300c4e501630b1842e60007'},   //待检区

			{x:3039,y:1304,text:"4",areaNo:'EX_3'},   //信息采集区门口
			{x:3250,y:1474,text:"5",areaNo:'EX_4'},   //尿检区门口
			{x:3700,y:1275,text:"6",areaNo:'a947d4a06300c4e501631edc2765004a'},   //尿检区

			{x:2866,y:1140,text:"7",areaNo:'EX_5'},   //看管区拐角
			{x:2990,y:1087,text:"8",areaNo:'a947d4a06300c4e501630b1915af000b'},   //看管区

			{x:3147,y:1029,text:"9",areaNo:'EX_6'},   //等候室1门口
			{x:3378,y:815,text:"10",areaNo:'a947d4a06300c4e501630b19e137000d'},   //等候室1

			{x:3030,y:935,text:"11",areaNo:'EX_7'},   //等候室2门口
			{x:3204,y:692,text:"12",areaNo:'a947d4a06300c4e501630b1a02f9000f'},   //等候室2

			{x:2970,y:880,text:"13",areaNo:'EX_8'},   //等候室3门口
			{x:2900,y:576,text:"14",areaNo:'a947d4a06300c4e501630b1a295e0011'},   //等候室3

			{x:2897,y:904,text:"15",areaNo:'EX_9'},   //等候室4门口
			{x:2676,y:637,text:"16",areaNo:'a947d4a06300c4e501630b1a581b0013'},   //等候室4

			{x:2640,y:916,text:"17",areaNo:'EX_10'},   // 0询问室1门口
			{x:2120,y:1216,text:"18",areaNo:'EX_11'},   //询问室1座椅旁
			{x:2024,y:1154,text:"19",areaNo:'a947d4a06300c4e501630b1b08a40016'},   //询问室1

			{x:2464,y:727,text:"20",areaNo:'EX_12'},   //询问室2门口
			{x:1940,y:1090,text:"21",areaNo:'EX_13'},   //询问室2座椅旁
			{x:1843,y:956,text:"22",areaNo:'a947d4a06300c4e501630b1b20780018'},   //询问室2

			{x:2226,y:503,text:"23",areaNo:'EX_14'},   //特殊询问室/询问室3门口
			{x:2817,y:588,text:"24",areaNo:'EX_15'},   //特殊询问室座椅旁
			{x:1597,y:703,text:"25",areaNo:'a947d4a06300c4e501630b1bc1a6001c'},   //特殊询问室

			{x:1808,y:942,text:"26",areaNo:'EX_16'},   //询问室3座椅旁
			{x:2584,y:386,text:"27",areaNo:'a947d4a06300c4e501630b1b4269001a'},   //询问室3

			{x:2597,y:1484,text:"28",areaNo:'EX_17'}   //采集区进入看守区拐角
		],
		/**
		 *    27  26                   12   10
		 *			      14    13     11    9
		 *                16    15           8                 6
		 *             ------------------
		 *        23      20         17      7     4     5
		 *                                         28    0
		 *                                           	 1  2
		 *   25   24   22 21      19 18                     3
		 */
		eArray:[
			[0,1,1],[0,28,1],[1,2,1],[2,3,1],[1,28,1],[4,5,1],[4,28,1],[4,7,1],[5,6,1],[7,8,1],[7,17,1],
			[8,9,1],[8,11,1],[8,15,2],[9,10,1],[9,11,1],[11,12,1],[11,13,1],[13,14,1],[13,15,1],
			[15,16,1],/*[17,18,1],*/[17,20,1],[17,19,1],/*[20,21,1],*/[20,23,1],[20,22,1],
			/*[23,24,1],*//*[23,26,1]*/[23,25,1],[23,27,1]
		]
	},
	//西兴
	"330108510000":{
		vArray:[
			{x:2330,y:603,text:"0",areaNo:'a947d0be735a733c01735a7dab2e0009'},   //登记区
			{x:2524,y:535,text:"1",areaNo:'EX_1'},   //登记区拐角

			{x:2430,y:460,text:"2",areaNo:'EX_2'},   //待检区门口
			{x:2240,y:295,text:"3",areaNo:'a947d0be735a733c01735a7e04b3000b'},   //待检区

			{x:2186,y:647,text:"4",areaNo:'EX_3'},   //登记区门口
			{x:2470,y:930,text:"5",areaNo:'EX_4'},   //尿检区门口
			{x:2946,y:750,text:"6",areaNo:'a947d0be735a733c01735a7f36ab000f'},   //尿检区

			{x:2600,y:1090,text:"7",areaNo:'EX_5'},   //看管区拐角
			{x:2110,y:1280,text:"8",areaNo:'a947d0be735a733c01735a7eff85000d'},   //看管区

			{x:2327,y:1110,text:"9",areaNo:'EX_6'},   //等候室1门口
			{x:2110,y:900,text:"10",areaNo:'a947d0be735a733c01735a80391d0011'},   //等候室1

			{x:2050,y:1216,text:"11",areaNo:'EX_7'},   //等候室2门口
			{x:1845,y:990,text:"12",areaNo:'a947d0be735a733c01735a80802b0013'},   //等候室2

			{x:2264,y:1292,text:"13",areaNo:'EX_8'},   //醒酒区门口
			{x:2433,y:1492,text:"14",areaNo:'a947d0be735a733c01735a81e88e001b'},   //醒酒区
			{x:2040,y:1383,text:"15",areaNo:'EX_9'},   //等候室3门口
			{x:2206,y:1590,text:"16",areaNo:'a947d0be735a733c01735a80af650015'},   //等候室3

			{x:2440,y:1230,text:"17",areaNo:'EX_10'},   //审讯室过道门口
			{x:2634,y:1115,text:"18",areaNo:'EX_11'},   //等候室4门口
			{x:2944,y:977,text:"19",areaNo:'a947d0be735a733c01735a80d1180017'},   //等候室4

			{x:2940,y:1730,text:"20",areaNo:'a947d0be735a733c01735a853dc20027'},   //审讯室走廊/询问室2门口
			{x:3108,y:1904,text:"21",areaNo:'EX_12'},   //询问室2拐角
			{x:2800,y:2045,text:"22",areaNo:'EX_13'},   //询问室2座椅旁
			{x:2873,y:2130,text:"23",areaNo:'a947d0be735a733c01735a8364c1001f'},   //询问室2

			{x:3137,y:1650,text:"24",areaNo:'EX_14'},   //特殊询问室门口
			{x:3300,y:1800,text:"25",areaNo:'EX_15'},   //特殊询问室座椅旁
			{x:3665,y:1630,text:"26",areaNo:'a947d0be735a733c01735a8438070023'},   //特殊询问室

			{x:3540,y:1490,text:"27",areaNo:'EX_16'},   //询问室1座椅旁
			{x:3457,y:1405,text:"28",areaNo:'a947d0be735a733c01735a8329d4001d'},   //询问室1

			{x:2393,y:1950,text:"29",areaNo:'EX_17'},   //询问室3门口
			{x:2560,y:2130,text:"30",areaNo:'EX_18'},   //询问室3座椅旁
			{x:2410,y:2195,text:"31",areaNo:'a947d0be735a733c01735a839d4e0021'},   //询问室3

			{x:2414,y:234,text:"32",areaNo:'a947d0be735a733c01735a7846110006'},    //办案区入口

			{x:2390,y:1177,text:"33",areaNo:'EX_19'}     //7和8之间的过渡区域

		],
		/**
		 *  32
		 *  3    2     1         6            19
		 *             0                                 28   27     26
		 *                                                    24     25
		 *             4         5      7     18
		 *                                                        22 23
		 *                  10   9      33    17              20  21
		 *                  12   11     8     13   14         29     30
		 *                                    15   16				 31
		 */
		eArray:[
			[0,1,1],[0,4,1],[1,2,1],[2,3,1],[3,32,1],[4,5,1],[5,6,1],[5,7,1],[5,9,1],[7,18,1],[7,33,1],
			[8,11,1],[8,17,2],[8,13,2],[8,33,1],[9,10,1],[9,11,1],[9,33,1],[11,12,1],[13,14,1],[13,15,1],[13,17,1],
			[15,16,1],[17,18,1],[17,20,1],[17,33,1],[18,19,1],[20,21,1],[20,24,1],[20,29,1],[21,22,1],[22,23,1],
			[24,25,1],[24,27,1],[25,26,1],[27,28,1],[29,30,1],[30,31,1]
		]
	},
	//长河
	"330108520000":{
		vArray:[
			{x:2008,y:456,text:"0",areaNo:'a947d2f065b2fdd60165c1414408000a'},   //登记区
			{x:1990,y:427,text:"1",areaNo:'EX_1'},   //登记区拐角

			{x:1830,y:465,text:"2",areaNo:'EX_2'},   //待检区门口
			{x:1680,y:224,text:"3",areaNo:'a947d2f065b2fdd60165c14272e5000c'},   //待检区

			{x:1547,y:252,text:"4",areaNo:'a947d2f065b2fdd60165c1479bd60024'},   //办案区入口

			{x:1747,y:616,text:"5",areaNo:'EX_4'},   //看管区拐角
			{x:1950,y:572,text:"6",areaNo:'a947d2f065d1e6b70165e5f9047a0054'},   //看管区

			{x:2029,y:682,text:"7",areaNo:'EX_5'},   //等候室1门口
			{x:1822,y:724,text:"8",areaNo:'a947d2f065b2fdd60165c143f5e80010'},   //等候室1

			{x:2140,y:848,text:"9",areaNo:'EX_6'},   //等候室2门口
			{x:1940,y:896,text:"10",areaNo:'a947d2f065b2fdd60165c14418470012'},   //等候室2

			{x:2190,y:925,text:"11",areaNo:'EX_7'},   //等候室3门口
			{x:1992,y:976,text:"12",areaNo:'a947d2f065b2fdd60165c144326b0014'},   //等候室3

			{x:2243,y:1008,text:"13",areaNo:'EX_8'},   //等候室4门口
			{x:2038,y:1058,text:"14",areaNo:'a947d2f065b2fdd60165c144519e0016'},   //等候室4

			{x:2306,y:1108,text:"15",areaNo:'EX_9'},   //等候室4门口右侧
			{x:2093,y:1160,text:"16",areaNo:'EX_10'},   //审讯室走廊门口
			{x:2223,y:1390,text:"17",areaNo:'a947d2f065b2fdd60165c1456d77001a'},   //审讯室走廊

			{x:2270,y:1477,text:"18",areaNo:'EX_11'},   //审讯室1门口
			{x:2670,y:1375,text:"19",areaNo:'EX_12'},   //审讯室1座椅旁边
			{x:2607,y:1288,text:"20",areaNo:'a947d2f065b2fdd60165c1460a42001c'},   //审讯室1

			{x:2347,y:1594,text:"21",areaNo:'EX_13'},   //尿检区门口
			{x:2783,y:1485,text:"22",areaNo:'a947d2f065b2fdd60165c144fad80018'},   //尿检区

			{x:2530,y:1890,text:"23",areaNo:'EX_14'},   //特殊审讯室门口
			{x:2995,y:1884,text:"24",areaNo:'EX_15'},   //特殊审讯室座椅旁
			{x:2928,y:1792,text:"25",areaNo:'a947d2f065b2fdd60165c14689120022'},   //特殊审讯室

			{x:2674,y:2120,text:"26",areaNo:'EX_16'},   //审讯室2门口
			{x:3067,y:2008,text:"27",areaNo:'EX_17'},   //审讯室2座椅旁
			{x:3067,y:2008,text:"28",areaNo:'a947d2f065b2fdd60165c1462189001e'},   //审讯室2

			{x:2820,y:2357,text:"29",areaNo:'EX_18'},   //询问室3门口
			{x:3296,y:2335,text:"30",areaNo:'EX_19'},   //询问室3座椅旁
			{x:3235,y:2250,text:"31",areaNo:'a947d2f065b2fdd60165c14639bb0020'}   //询问室3

		],
		/**
		 *      1     0
		 * 3    2
		 *                     6      7    9   11  13   15      20 19    22  25 24   27 28  31 30
		 *                         |                  |
		 * 4                   5   |  8    10  12  14 | 16   17    18    21     23   26        29
		 *
		 */
		eArray:[
			[0,1,1],[1,2,1],[2,3,1],[3,4,1],[4,5,1],[5,6,1],[6,7,1],[7,8,1],[7,9,1],
			[9,10,1],[9,11,1],[11,12,1],[11,13,1],[13,14,1],[13,15,1],[15,16,1],[16,17,1],
			/*[17,18,1],[18,19,1],[18,21,1],[19,20,1],*/[17,20,1],[17,21,1],[21,22,1],[21,23,1],/*[23,24,1],*/[23,26,1],[23,25,1],
			/*[26,27,1],*/[26,29,1],[26,28,1],/*[29,30,1],*/[29,31,1]
		]
	}

};